W6D3/art_share_API/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # render plain: "I'm in the index action!"
    render json: User.all

INSERT INTO "users" ("username", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "\"Imposter\""], ["password", "\"killall\""], ["email", "\"stop_crewmates@gmail.com\""], ["created_at", "2020-10-28 23:15:34.164577"], ["updated_at", "2020-10-28 23:15:34.164577"]]
---
  def create
    user = User.new(users_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 102], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "Will"], ["password", "killsome"], ["updated_at", "2020-10-28 23:18:36.076879"], ["id", 102]]
---
  def update
    user = User.find_by(id: params[:id])

    if user.update(users_params)