W7D2/music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
<h2>ALBUMS</h2>
<% if @band.albums.blank? %>