W7D3/goal_app/app/controllers/goals_controller.rb

  def create
    @goal = Goal.new(goal_params)

    respond_to do |format|
      if @goal.save
---
INSERT INTO "goals" ("title", "details", "private", "completed", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "title "], ["details", "details"], ["private", true], ["completed", true], ["user_id", 3], ["created_at", "2020-11-05 15:24:54.361011"], ["updated_at", "2020-11-05 15:24:54.361011"]]

  def update
    @goal = Goal.find_by(id: params[:id])
    @goal.completed = !@goal.completed
    @goal.save!
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "goals" SET "completed" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["completed", false], ["updated_at", "2020-11-05 15:45:46.445027"], ["id", 1]]

  def set_goal
    @goal = Goal.find(params[:id])
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]