W7D2/music_app/app/models/user.rb

INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-11-08 21:23:22.959306"], ["session_token", "lU8AbkFd6bsuyBDNU9x2nQ"], ["id", 5]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!