W6D4/art_share_API/app/controllers/artworks_controller.rb

  def index

    if params[:artist_id]
        render json: User.find_by(id: params[:artist_id]).artworks
    elsif params[:viewer_id]
        render json: User.find_by(id: params[:viewer_id]).shared_artworks
    else #delete else statement later
        render json: Artwork.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"