W7D2/music_app/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"
---
  def new
    @album = Album.new
    @band = Band.find_by(id: params[:band_id])
    @bands = Band.all

INSERT INTO "albums" ("name", "band_id", "live", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "12222"], ["band_id", 1], ["live", true], ["year", 1233], ["created_at", "2020-11-08 07:11:56.713139"], ["updated_at", "2020-11-08 07:11:56.713139"]]
---
  def create
    @album = Album.new(album_params)
    @album.band_id = params[:band_id]

    if @album.save