W7D2/music_app/app/controllers/bands_controller.rb

DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 5]]
---
  def destroy
    @band.destroy

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_band
    @band = Band.find(params[:id])