W7D2/music_app/app/controllers/notes_controller.rb

INSERT INTO "notes" ("content", "user_id", "track_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "123123123"], ["user_id", 1], ["track_id", 2], ["created_at", "2020-11-08 21:19:51.137942"], ["updated_at", "2020-11-08 21:19:51.137942"]]
---
  def create
    @note = Note.new(note_params)
    @note.user_id = current_user.id
    @note.track_id = params[:track_id]

    flash.now[:errors] = @notes.errors.full_messages unless @note.save