W7D2/music_app/app/controllers/tracks_controller.rb

  def new
    @track = Track.new
    @album = Album.find_by(id: params[:album_id])
    @albums = Album.all
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "albums".* FROM "albums"

  def create
    @track = Track.new(track_params)
    @track.album_id = params[:album_id]

    if @track.save
---
INSERT INTO "tracks" ("name", "album_id", "ord", "standard", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "123123"], ["album_id", 8], ["ord", 2], ["standard", true], ["lyrics", "321321"], ["created_at", "2020-11-08 20:11:10.799986"], ["updated_at", "2020-11-08 20:11:10.799986"]]

  def destroy
    @album = @track.album
    @track.destroy
---
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 3]]