W7D2/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save