W7D2/music_app/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 9]]
---
<%= @album.name %>
<% @album.tracks&.each do |track| %>