W7D3/goal_app/app/views/users/_goal_form.html.erb

<% if user.goals.any? %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 3]]
SELECT 1 AS one FROM "goals" WHERE "goals"."user_id" = $1 LIMIT $2  [["user_id", 5], ["LIMIT", 1]]

  <h1><%= user.username %>'s Goals:</h1>
  <% user.goals.each do |goal| %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 3]]