W7D2/music_app/app/views/tracks/show.html.erb

<h1>NOTES</h1>
<% @track.notes&.each do |note| %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 2]]